{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "CV_Molka_Jlassi.pdf",
  "Loading": "Loading...",

  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I am a software architecture engineering graduate from ESPRIT, motivated to start my career as a software engineer to turn my knowledge into real solutions. Passionate about new technologies, high-performance system design, <span class='underline'>web development</span>, and <span class='underline'>software testing</span>, I am dedicated to contributing to innovative projects and bringing real value to the team.",
  "Banner.ActionBtn": "Say Hi",

 "AboutMe.EducationTitle": "Education",
"AboutMe.Education": [
  {
    "Degree": "SOFTWARE ENGINEERING DEGREE",
    "School": "Private Higher School of Engineering and Technology (ESPRIT)",
    "Year": "2022 — 2025"
  },
  {
    "Degree": "BACHELOR’S DEGREE IN COMPUTER SCIENCE",
    "School": "Higher Institute of Multimedia Arts of Manouba (ISAMM)",
    "Year": "2019 — 2022"
  }
],




  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "During my academic and professional projects, I had the opportunity to work on real-world applications that strengthened my technical and problem-solving skills. I enjoy turning ideas into functional, user-friendly solutions.",
  
  "I contributed to several impactful software projects that involved designing, developing, and improving real-world applications. These experiences allowed me to collaborate effectively with teams, understand business requirements, and design efficient and scalable technical workflows.",
  
  "I also enjoy exploring software quality and automation tools. I have worked with CI/CD pipelines, testing practices, and modern development environments to ensure clean, reliable, and maintainable code.",
  
  "Some of the tools, frameworks, and architectures I frequently work with include (but are not limited to):"
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
    "Tab": "ACTIA",
    "Title": "Engineer Degree Final Year Internship",
    "Date": "February - August 2025",
    "Description": [
      "Designed and developed an intelligent Learning Management System to centralize and automate employee training paths, improving accessibility and organization of training materials.",
  "Integrated a request management workflow, allowing employees to submit training requests and managers to track and approve them efficiently.",
  "Implemented personalized learning tracking to monitor employee progress and provide relevant feedback.",
  "Included skills evaluation features to assess employee competencies and identify areas for improvement.",
  "Enhanced talent development and improved internal process efficiency by streamlining training management and facilitating better oversight."
    ],
    "Keywords": ["Angular", "SpringBoot", "Microservices", "Keycloak", "Gateway", "PostgreSQL", "Discovery", "Docker", "AI", "GitLab"]
  },
  {
    "Tab": "Ticgeek",
    "Title": "Summer Internship",
    "Date": "July - September 2024",
    "Description": [
        "Designed and developed an innovative application for gyms, centralizing operations related to members, coaches, schedules, and subscriptions.",
  "Created an ergonomic interface to optimize operational efficiency and enhance user experience.",
  "Implemented features to manage memberships, track coaching schedules, and monitor subscription statuses effectively.",
  "Ensured smooth interaction between frontend and backend systems to maintain reliable data flow and consistency."
    ],
    "Keywords": ["Angular", "Node.js", "PrimeNG", "MongoDB", "GitLab"]
  },
  {
    "Tab": "Onwireway",
    "Title": "Summer Internship",
    "Date": "August 2023",
    "Description": [
      "Developed the frontend interface for an e-commerce application specialized in selling IoT devices, ensuring a user-friendly and responsive design.",
  "Implemented business modules for product tracking, order management, and payment processing, enabling smooth and efficient operations.",
  "Optimized interface components to improve navigation, usability, and overall user experience."
    ],
    "Keywords": ["Angular", "Bootstrap", "PrimeNG", "GitHub"]
  },
  {
    "Tab": "Premiere Consulting",
    "Title": "License Degree Final Year Internship",
    "Date": "February - June 2022",
    "Description": [
       "Designed and deployed an Electronic Document Management (EDM) solution with automated workflows for document classification, storage, and archiving, enabling faster and more reliable handling of company documents.",
  "Developed features to facilitate easy document retrieval, secure storage, and efficient management of digital files, reducing errors and improving accessibility.",
  "Optimized internal processes by eliminating redundant manual tasks, decreasing dependency on paper, and enhancing overall operational efficiency.",
  "Provided a scalable solution that supports future growth and ensures compliance with company document management standards."
    ],
    "Keywords": ["Symfony", "Doctrine", "JavaScript", "MySQL", "GitHub"]
  }
  ],

  "FeatureProjects.Title": "My Projects",
  "FeatureProjects.Label": "Highlighted Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Learning Management System (LMS)",
      "Description": "Intelligent Learning Management System for centralizing and automating employee training paths, including <span class='underline'>training request workflows</span>, <span class='underline'>personalized learning tracking</span>, and <span class='underline'>skills assessment</span>, designed to enhance <span class='underline'>talent development</span> and <span class='underline'>internal process efficiency</span>.",
      "imgs": [
        "assets/images/lms/Dashlms.png",
        "assets/images/lms/lms2.png",
        "assets/images/lms/quiz.png",
        "assets/images/lms/workflow.png",
        "assets/images/lms/presenlms.png"
      ],
      "Technologies": ["Angular", "SpringBoot", "Keycloak", "Microservices","Gateway"," PostgreSQL","Docker"," IA","GitLab"]
    },
    {
      "Title": "GymFlow",
      "Description":"Development of an innovative application for gyms, centralizing key operations for <span class='underline'>members</span>, <span class='underline'>coaches</span>, <span class='underline'>schedules</span>, and <span class='underline'>subscriptions</span>, with an intuitive interface aimed at optimizing <span class='underline'>operational efficiency</span> and <span class='underline'>user experience</span>.",
      "imgs": [
        "assets/images/gymflow/gymflow1.JPG",
        
        "assets/images/gymflow/gymflow3.JPG",
        "assets/images/gymflow/gymflow4.JPG",
        "assets/images/gymflow/gymflow.JPG"
       
      ],
      "Technologies": ["Angular", "Node.js", "Express.js","PrimeNG", "MongoDB", "GitLab"]
    },
     {
      "Title": "Automated CI/CD for a School Management Application",
      "Description": "Automation of a <span class='underline'>CI/CD pipeline</span> for a school management application. Integration of <span class='underline'>Nexus</span>, <span class='underline'>SonarQube</span>, <span class='underline'>Jenkins</span>, and <span class='underline'>Prometheus/Grafana</span> for automation and monitoring. <span class='underline'>Mockito tests</span>, <span class='underline'>JaCoCo reports</span>, and <span class='underline'>security scans</span> ensure reliable deployments.",
      "imgs": [
        "assets/images/devops/1devops.jpg",
        "assets/images/devops/2devops.jpg",
        "assets/images/devops/3devops.jpg",
        "assets/images/devops/4devops.jpg"
        
      ],
      "Technologies": ["Docker", "Jenkins", "Nexus", "SonarQube", "Mockito", "Grafana", "Prometheus"]
    },
    {
      "Title": "IoTShop ",
      "Description": "Development of the <span class='underline'>frontend interface</span> of an e-commerce application specialized in selling IoT devices, with implementation of <span class='underline'>business modules</span> for <span class='underline'>product tracking</span>, <span class='underline'>order management</span>, and <span class='underline'>payment processing</span>. Developed using <span class='underline'>Angular</span> and <span class='underline'>PrimeNG</span>.",
      "imgs": [
        "assets/images/iot/capac.png",
        "assets/images/iot/produits.PNG",
        "assets/images/iot/article details.PNG",
        "assets/images/iot/panier.jpg"

      ],
      "Technologies": ["Angular", "PrimeNG", "GitHub", "TypeScript"]
    },
    
   
    
    {
      "Title": "MY WAY",
      "Description": "Design and development of a <span class='underline'>tourist transport application</span> that guides tourists through their <span class='underline'>itineraries</span> and displays available <span class='underline'>transport options</span> and <span class='underline'>routes</span>. The application includes <span class='underline'>web</span> and <span class='underline'>mobile user interfaces</span> for a smooth and seamless experience. Developed using <span class='underline'>JavaFX</span>, <span class='underline'>Symfony framework</span>, <span class='underline'>MySQL</span>, and <span class='underline'>GitHub</span>.",
      "imgs": [
        "assets/images/myway/myway3.PNG",
        "assets/images/myway/myway.PNG"
       
       
      ],
      "Technologies": ["JavaFX", "Symfony", "MySQL", "GitHub"]
    },
    
    {
      "Title": "LearnToCode",
      "Description": "Development of an <span class='underline'>interactive e-learning website</span> including <span class='underline'>training sections</span>, <span class='underline'>assessments</span>, and <span class='underline'>learner progress tracking</span>. The interface is designed to be <span class='underline'>intuitive</span> and <span class='underline'>engaging</span>, facilitating online learning. Developed using <span class='underline'>JavaScript</span>, <span class='underline'>HTML5</span>, and <span class='underline'>CSS</span>.",
      "imgs": [
        "assets/images/learntocode/elear1.PNG",
        "assets/images/learntocode/elear2.PNG"
       
      ],
      "Technologies": ["JavaScript", "HTML5", "CSS"]
    },
    {
      "Title": "Electronic Document Management (EDM) Solution",
      "Description": "Design and deployment of an <span class='underline'>Electronic Document Management (EDM) solution</span> integrating <span class='underline'>automated workflows</span> for document classification, storage, and archiving, optimizing internal processes and reducing paper dependency. Developed with <span class='underline'>Symfony</span>, <span class='underline'>Doctrine</span>, <span class='underline'>JavaScript</span>, and <span class='underline'>MySQL</span>.",
      "imgs": [
        "assets/images/ged/listediff.PNG",
        "assets/images/ged/g-document.png"
        
        
      ],
      "Technologies": ["Symfony", "Doctrine", "JavaScript", "MySQL", "GitHub"]
    }
  ],

  "OtherProjects.Title": "More Projects",
  "OtherProjects.Projects": [
    {
      "Title": "EduConect",
      "Description": "Microservices project using Node.js, Spring Boot, MongoDB, MySQL, and Docker. It includes management of students and contacts via separate Spring services. Each service is containerized with Docker, enabling simplified management and smooth deployment of the infrastructure.",
      "ghLink": "https://github.com/jlassimolka/EduConnect.git",
      "Technologies": ["Node.js", "Spring Boot", "MongoDB", "MySQL", "Docker"]
      
      
    },

   {
     "Title": "Book Reservation Manager",
     "Description": "Android application for managing book reservations, featuring full CRUD operations, search functionality, calendar-based reservations, and pagination for smooth and user-friendly navigation.",
     "ghLink": "https://github.com/jlassimolka/BookReservationManager.git",
     "Technologies": ["Android", "Java", "CRUD", "SQLite", "Calendar"]
    }
    ,
     {
   "Title": "Alumni-Job Clustering",
   "Description": "Application using K-Means clustering to group alumni and job offers based on their characteristics. It matches alumni with offers in their cluster and visualizes the number of offers per domain. Users can enter an alumni ID to get the corresponding offers.",
   "ghLink": "https://github.com/jlassimolka/K-means_offers_profiles.git", 
   "Technologies": ["Python", "Machine Learning", "K-Means", "Data Visualization"]
    }
,
 {
  "Title": "Hireflix",
  "Description": "Full-stack application with Angular frontend and Spring Boot backend for managing students in the Hireflix platform, dedicated to company forums. Features include search and scheduled tasks using Spring Cron.",
  "ghLink": "https://github.com/jlassimolka/hireflix-backend.git",
  "Technologies": ["Angular", "Spring Boot", "MySQL", "Spring Cron"]
},
   {
  "Title": "Selenium Automation Project",
  "Description": "This repository contains a hands-on Selenium automation testing project using Java. It is designed to learn UI test automation by building a real project, following best practices such as Page Object Model (POM), TestNG, and Maven.",
  "ghLink": "https://github.com/jlassimolka/java-selenium-automation.git",
  "Technologies": ["Selenium", "Java", "TestNG", "Maven", "UI Automation"]
}

,
    
 
    {
  "Title": "GymFlow",
  "Description": "Web application that makes it easy to search for gyms and coaches, view their services, and book sessions online. It provides a simple and intuitive interface for optimal management of users' fitness journey.",
  "ghLink": "https://github.com/jlassimolka/GymFlow_Backend.git",
  "Technologies": ["Node.js", "Angular", "PrimeNG", "MongoDB"]
   }

  ],

  "Contact.Pretitle": "And... Now?",
  "Contact.Title": "Say Hi!",
  "Contact.Content": "I will be glad to hear from you if you want to discuss new opportunities. Write to me, and I will respond as soon as I see your message.",
  "Contact.Btn": "Contact Me"
}
