{
  "Header.Item1": "À propos de moi",
  "Header.Item2": "Expérience",
  "Header.Item3": "Projets",
  "Header.Item4": "Contact",
  "Header.cvBtn": "CV",
  "Header.cvName": "CV_Molka_Jlassi.pdf",
  "Loading": "Chargement...",

  "Banner.Pretitle": "Bonjour ! Je m'appelle",
  "Banner.Description": "Je suis diplômée en ingénierie de l'architecture logicielle de l'ESPRIT, motivée pour commencer ma carrière en tant qu'ingénieure logiciel afin de transformer mes connaissances en solutions réelles. Passionnée par les nouvelles technologies, la conception de systèmes performants, <span class='underline'>le développement web</span> et <span class='underline'>les tests logiciels</span>, je suis dédiée à contribuer à des projets innovants et à apporter une réelle valeur à l'équipe.",
  "Banner.ActionBtn": "Dire Bonjour",
  "AboutMe.EducationTitle": "Éducation",
"AboutMe.Education": [
  {
    "Degree": "Ingénierie en architecture logicielle",
    "School": "École supérieure privée d'ingénierie et de technologie (ESPRIT)",
    "Year": "2022 - 2025"
  },
  {
    "Degree": "Licence Fondamentale en Informatique",
    "School": "Institut Supérieur des Arts Multimédia de la Manouba (ISAMM) ",
    "Year": "2019 - 2022"
  }
],


  "AboutMe.Title": "À propos de moi",
  "AboutMe.Paragraphs": [
    "Au cours de mes projets académiques et professionnels, j'ai eu l'occasion de travailler sur des applications réelles qui ont renforcé mes compétences techniques et en résolution de problèmes. J'aime transformer les idées en solutions fonctionnelles et conviviales.",
    "J'ai contribué à plusieurs projets logiciels impactants impliquant la conception, le développement et l'amélioration d'applications réelles. Ces expériences m'ont permis de collaborer efficacement avec des équipes, de comprendre les besoins métiers et de concevoir des workflows techniques efficaces et évolutifs.",
    "J'aime également explorer les outils de qualité logicielle et d'automatisation. J'ai travaillé avec des pipelines CI/CD, des pratiques de tests et des environnements de développement modernes pour garantir un code propre, fiable et maintenable.",
    "Certains des outils, frameworks et architectures que j'utilise fréquemment incluent (mais ne sont pas limités à) :"
  ],

  "Experience.Title": "Expérience",
  "Experience.Jobs": [
    {
      "Tab": "ACTIA",
      "Title": "Stage de fin d'études d'ingénieur",
      "Date": "Février - Août 2025",
      "Description": [
        "Conception et développement d'un système de gestion de formation intelligent pour centraliser et automatiser les parcours de formation des employés, améliorant l'accessibilité et l'organisation des supports de formation.",
        "Intégration d'un workflow de gestion des demandes permettant aux employés de soumettre des demandes de formation et aux managers de les suivre et approuver efficacement.",
        "Mise en place d'un suivi personnalisé de l'apprentissage pour surveiller les progrès des employés et fournir des retours pertinents.",
        "Ajout de fonctionnalités d'évaluation des compétences pour identifier les domaines à améliorer.",
        "Amélioration du développement des talents et de l'efficacité des processus internes en rationalisant la gestion de la formation et en facilitant une meilleure supervision."
      ],
      "Keywords": ["Angular", "SpringBoot", "Microservices", "Keycloak", "Gateway", "PostgreSQL", "Discovery", "Docker", "IA", "GitLab"]
    },
    {
      "Tab": "Ticgeek",
      "Title": "Stage d'été",
      "Date": "Juillet - Septembre 2024",
      "Description": [
        "Conception et développement d'une application innovante pour les salles de sport, centralisant les opérations liées aux membres, aux coachs, aux plannings et aux abonnements.",
        "Création d'une interface ergonomique pour optimiser l'efficacité opérationnelle et améliorer l'expérience utilisateur.",
        "Mise en place de fonctionnalités pour gérer les adhésions, suivre les plannings des coachs et surveiller efficacement l'état des abonnements.",
        "Assurer l'interaction fluide entre le frontend et le backend pour maintenir un flux de données fiable et cohérent."
      ],
      "Keywords": ["Angular", "Node.js", "PrimeNG", "MongoDB", "GitLab"]
    },
    {
      "Tab": "Onwireway",
      "Title": "Stage d'été",
      "Date": "Août 2023",
      "Description": [
        "Développement de l'interface frontend d'une application e-commerce spécialisée dans la vente de dispositifs IoT, garantissant un design convivial et responsive.",
        "Implémentation des modules métiers pour le suivi des produits, la gestion des commandes et le traitement des paiements, assurant des opérations fluides et efficaces.",
        "Optimisation des composants de l'interface pour améliorer la navigation, l'ergonomie et l'expérience utilisateur globale."
      ],
      "Keywords": ["Angular", "Bootstrap", "PrimeNG", "GitHub"]
    },
    {
      "Tab": "Premiere Consulting",
      "Title": "Stage de fin d'études Licence",
      "Date": "Février - Juin 2022",
      "Description": [
        "Conception et déploiement d'une solution de gestion électronique des documents (GED) avec workflows automatisés pour la classification, le stockage et l'archivage des documents, permettant une gestion plus rapide et fiable des documents de l'entreprise.",
        "Développement de fonctionnalités pour faciliter la récupération facile des documents, le stockage sécurisé et la gestion efficace des fichiers numériques, réduisant les erreurs et améliorant l'accessibilité.",
        "Optimisation des processus internes en éliminant les tâches manuelles redondantes, diminuant la dépendance au papier et améliorant l'efficacité opérationnelle globale.",
        "Fourniture d'une solution évolutive supportant la croissance future et garantissant la conformité aux standards de gestion documentaire de l'entreprise."
      ],
      "Keywords": ["Symfony", "Doctrine", "JavaScript", "MySQL", "GitHub"]
    }
  ],

  "FeatureProjects.Title": "Mes Projets",
  "FeatureProjects.Label": "Projets principaux",
  "FeatureProjects.Projects": [
    {
      "Title": "Système de Gestion de Formation (LMS)",
      "Description": "Système intelligent de gestion de formation pour centraliser et automatiser les parcours de formation des employés, incluant <span class='underline'>les workflows de demande de formation</span>, <span class='underline'>le suivi personnalisé de l'apprentissage</span> et <span class='underline'>l'évaluation des compétences</span>, conçu pour améliorer le <span class='underline'>développement des talents</span> et <span class='underline'>l'efficacité des processus internes</span>.",
      "imgs": [
        "assets/images/lms/Dashlms.png",
        "assets/images/lms/lms2.png",
        "assets/images/lms/quiz.png",
        "assets/images/lms/workflow.png",
        "assets/images/lms/presenlms.png"
      ],
      "Technologies": ["Angular", "SpringBoot", "Keycloak", "Microservices", "Gateway", "PostgreSQL", "Docker", "IA", "GitLab"]
    },
    {
      "Title": "GymFlow",
      "Description":"Développement d'une application innovante pour les salles de sport, centralisant les opérations clés pour les <span class='underline'>membres</span>, les <span class='underline'>coach</span>, les <span class='underline'>plannings</span> et les <span class='underline'>abonnements</span>, avec une interface intuitive visant à optimiser <span class='underline'>l'efficacité opérationnelle</span> et <span class='underline'>l'expérience utilisateur</span>.",
      "imgs": [
        "assets/images/gymflow/gymflow1.JPG",
        "assets/images/gymflow/gymflow3.JPG",
        "assets/images/gymflow/gymflow4.JPG",
        "assets/images/gymflow/gymflow.JPG"
      ],
      "Technologies": ["Angular", "Node.js", "Express.js", "PrimeNG", "MongoDB", "GitLab"]
    },
    {
      "Title": "Automatisation CI/CD pour une application scolaire",
      "Description": "Automatisation d'un <span class='underline'>pipeline CI/CD</span> pour une application de gestion scolaire. Intégration de <span class='underline'>Nexus</span>, <span class='underline'>SonarQube</span>, <span class='underline'>Jenkins</span> et <span class='underline'>Prometheus/Grafana</span> pour l'automatisation et la supervision. <span class='underline'>Tests Mockito</span>, <span class='underline'>rapports JaCoCo</span> et <span class='underline'>analyses de sécurité</span> assurent des déploiements fiables.",
      "imgs": [
        "assets/images/devops/1devops.jpg",
        "assets/images/devops/2devops.jpg",
        "assets/images/devops/3devops.jpg",
        "assets/images/devops/4devops.jpg"
      ],
      "Technologies": ["Docker", "Jenkins", "Nexus", "SonarQube", "Mockito", "Grafana", "Prometheus"]
    },
    {
      "Title": "IoTShop",
      "Description": "Développement de l'<span class='underline'>interface frontend</span> d'une application e-commerce spécialisée dans la vente de dispositifs IoT, avec implémentation des <span class='underline'>modules métiers</span> pour le <span class='underline'>suivi des produits</span>, la <span class='underline'>gestion des commandes</span> et le <span class='underline'>traitement des paiements</span>. Développé avec <span class='underline'>Angular</span> et <span class='underline'>PrimeNG</span>.",
      "imgs": [
        "assets/images/iot/capac.png",
        "assets/images/iot/produits.PNG",
        "assets/images/iot/article details.PNG",
        "assets/images/iot/panier.jpg"
      ],
      "Technologies": ["Angular", "PrimeNG", "GitHub", "TypeScript"]
    },
    {
      "Title": "MY WAY",
      "Description": "Conception et développement d'une <span class='underline'>application de transport touristique</span> guidant les touristes à travers leurs <span class='underline'>itinéraires</span> et affichant les <span class='underline'>options de transport</span> et <span class='underline'>trajets</span> disponibles. L'application inclut des interfaces <span class='underline'>web</span> et <span class='underline'>mobiles</span> pour une expérience fluide. Développée avec <span class='underline'>JavaFX</span>, <span class='underline'>Symfony</span>, <span class='underline'>MySQL</span> et <span class='underline'>GitHub</span>.",
      "imgs": [
        "assets/images/myway/myway3.PNG",
        "assets/images/myway/myway.PNG"
      ],
      "Technologies": ["JavaFX", "Symfony", "MySQL", "GitHub"]
    },
    {
      "Title": "LearnToCode",
      "Description": "Développement d'un <span class='underline'>site e-learning interactif</span> incluant des <span class='underline'>sections de formation</span>, des <span class='underline'>évaluations</span> et le <span class='underline'>suivi des progrès des apprenants</span>. L'interface est conçue pour être <span class='underline'>intuitive</span> et <span class='underline'>engageante</span>. Développé avec <span class='underline'>JavaScript</span>, <span class='underline'>HTML5</span> et <span class='underline'>CSS</span>.",
      "imgs": [
        "assets/images/learntocode/elear1.PNG",
        "assets/images/learntocode/elear2.PNG"
      ],
      "Technologies": ["JavaScript", "HTML5", "CSS"]
    },
    {
      "Title": "Gestion Électronique des Documents (GED)",
      "Description": "Conception et déploiement d'une <span class='underline'>solution GED</span> intégrant des <span class='underline'>workflows automatisés</span> pour la classification, le stockage et l'archivage des documents, optimisant les processus internes et réduisant la dépendance au papier. Développée avec <span class='underline'>Symfony</span>, <span class='underline'>Doctrine</span>, <span class='underline'>JavaScript</span> et <span class='underline'>MySQL</span>.",
      "imgs": [
        "assets/images/ged/listediff.PNG",
        "assets/images/ged/g-document.png"
      ],
      "Technologies": ["Symfony", "Doctrine", "JavaScript", "MySQL", "GitHub"]
    }
    
  ],

  "OtherProjects.Title": "Autres Projets",
  "OtherProjects.Projects": [
    {
      "Title": "EduConect",
      "Description": "Projet microservices utilisant Node.js, Spring Boot, MongoDB, MySQL et Docker. Il inclut la gestion des étudiants et contacts via des services Spring séparés. Chaque service est containerisé avec Docker, facilitant la gestion et le déploiement de l'infrastructure.",
      "ghLink": "https://github.com/jlassimolka/EduConnect.git",
      "Technologies": ["Node.js", "Spring Boot", "MongoDB", "MySQL", "Docker"]
    },
    {
      "Title": "Book Reservation Manager",
      "Description": "Application Android pour gérer les réservations de livres, incluant toutes les opérations de gestion, recherche, réservations basées sur le calendrier et pagination pour une navigation fluide.",
      "ghLink": "https://github.com/jlassimolka/BookReservationManager.git",
      "Technologies": ["Android", "Java", "CRUD", "SQLite", "Calendrier"]
    },
    {
      "Title": "Alumni-Job Clustering",
      "Description": "Application utilisant le clustering K-Means pour regrouper les alumni et les offres d'emploi selon leurs caractéristiques. Elle permet d'associer chaque alumni aux offres de son cluster et de visualiser la répartition des offres par domaine.",
      "ghLink": "https://github.com/jlassimolka/K-means_offers_profiles.git",
      "Technologies": ["Python", "Machine Learning", "K-Means", "Visualisation de données"]
    },
    {
      "Title": "Hireflix",
      "Description": "Application full-stack avec frontend Angular et backend Spring Boot pour gérer les étudiants sur la plateforme Hireflix, dédiée aux forums d'entreprise. Inclut recherche et tâches planifiées via Spring Cron.",
      "ghLink": "https://github.com/jlassimolka/hireflix-backend.git",
      "Technologies": ["Angular", "Spring Boot", "MySQL", "Spring Cron"]
    },
   {
    "Title": "Projet d'Automatisation Selenium",
    "Description": "Projet pratique d'automatisation de tests UI avec Selenium en Java, utilisant Page Object Model (POM), TestNG et Maven.",
    "ghLink": "https://github.com/jlassimolka/java-selenium-automation.git",
    "Technologies": ["Selenium", "Java", "TestNG", "Maven", "Automatisation UI"]
   }
   ,
    {
      "Title": "GymFlow",
      "Description": "Application web facilitant la recherche de salles de sport et de coachs, la consultation de leurs services et la réservation de séances en ligne. Fournit une interface simple et intuitive pour une gestion optimale du parcours sportif des utilisateurs.",
      "ghLink": "https://github.com/jlassimolka/GymFlow_Backend.git",
      "Technologies": ["Node.js", "Angular", "PrimeNG", "MongoDB"]
    }
  ],

  "Contact.Pretitle": "Et... maintenant ?",
  "Contact.Title": "Dis-moi bonjour !",
  "Contact.Content": "Je serai ravie de vous lire si vous souhaitez discuter de nouvelles opportunités. Écrivez-moi, et je répondrai dès que je verrai votre message.",
  "Contact.Btn": "Contactez-moi"
}
